#include <stdio.h>

int main() {
    // บรรทัดที่ 1: a = 0.617%
    printf("a=%6.3f%%\n", 0.617); // ใช้ %6.3f คือ มี 6 ช่อง ชิดขวา เเละทศนิยม 3 ตำแหน่ง

    // บรรทัดที่ 2: b = 25%
    printf("b=%4d%%\n", 25); // ใช้ %4d คือ มี 4 ช่อง ชิดขวา เป็นเลขจำนวนเต็ม

    // บรรทัดที่ 3: c = 19.000%
    printf("c =%6.3f%%\n", 19.0); // ใช้ %6.3f ช่องกว้าง 6 ชิดฝั่งขวาแสดงทศนิยม 3 ตำแหน่ง

    // บรรทัดที่ 4: d = 9%
    printf("d  =%-2d%%\n", 9); // ใช้ %-2d คือ มี 2 ช่อง ชิดซ้าย เป็นเลขจำนวนเต็ม

    // บรรทัดที่ 5: e = 124.555%
    printf("e=%7.3f%%\n", 124.555); // ใช้ %7.3f คือ มี 7 ช่อง ชิดขวา เเละทศนิยม 3 ตำแหน่ง

    // บรรทัดที่ 6: f = 0.001%
    printf("f=%5.3f%%\n", 0.001); // ใช้ %5.3f คือ มี 5 ช่อง ชิดขวา เเละทศนิยม 3 ตำแหน่ง

    return 0;
}